// Big thanks to https://github.com/createwebid/fancy-font-generator

const bold_map = {
    "0": "𝟎", "1": "𝟏", "2": "𝟐", "3": "𝟑", "4": "𝟒",
    "5": "𝟓", "6": "𝟔", "7": "𝟕", "8": "𝟖", "9": "𝟗",
    "a": "𝐚", "b": "𝐛", "c": "𝐜", "d": "𝐝", "e": "𝐞",
    "f": "𝐟", "g": "𝐠", "h": "𝐡", "i": "𝐢", "j": "𝐣",
    "k": "𝐤", "l": "𝐥", "m": "𝐦", "n": "𝐧", "o": "𝐨",
    "p": "𝐩", "q": "𝐪", "r": "𝐫", "s": "𝐬", "t": "𝐭",
    "u": "𝐮", "v": "𝐯", "w": "𝐰", "x": "𝐱", "y": "𝐲",
    "z": "𝐳", "A": "𝐀", "B": "𝐁", "C": "𝐂", "D": "𝐃",
    "E": "𝐄", "F": "𝐅", "G": "𝐆", "H": "𝐇", "I": "𝐈",
    "J": "𝐉", "K": "𝐊", "L": "𝐋", "M": "𝐌", "N": "𝐍",
    "O": "𝐎", "P": "𝐏", "Q": "𝐐", "R": "𝐑", "S": "𝐒",
    "T": "𝐓", "U": "𝐔", "V": "𝐕", "W": "𝐖", "X": "𝐗",
    "Y": "𝐘", "Z": "𝐙"
};

const bold_italic_map = {
    "0": "𝟬", "1": "𝟭", "2": "𝟮", "3": "𝟯", "4": "𝟰",
    "5": "𝟱", "6": "𝟲", "7": "𝟳", "8": "𝟴", "9": "𝟵",
    "a": "𝒂", "b": "𝒃", "c": "𝒄", "d": "𝒅", "e": "𝒆",
    "f": "𝒇", "g": "𝒈", "h": "𝒉", "i": "𝒊", "j": "𝒋",
    "k": "𝒌", "l": "𝒍", "m": "𝒎", "n": "𝒏", "o": "𝒐",
    "p": "𝒑", "q": "𝒒", "r": "𝒓", "s": "𝒔", "t": "𝒕",
    "u": "𝒖", "v": "𝒗", "w": "𝒘", "x": "𝒙", "y": "𝒚",
    "z": "𝒛", "A": "𝑨", "B": "𝑩", "C": "𝑪", "D": "𝑫",
    "E": "𝑬", "F": "𝑭", "G": "𝑮", "H": "𝑯", "I": "𝑰",
    "J": "𝑱", "K": "𝑲", "L": "𝑳", "M": "𝑴", "N": "𝑵",
    "O": "𝑶", "P": "𝑷", "Q": "𝑸", "R": "𝑹", "S": "𝑺",
    "T": "𝑻", "U": "𝑼", "V": "𝑽", "W": "𝑾", "X": "𝑿",
    "Y": "𝒀", "Z": "𝒁"
};

const italic_map = {
    "0": "0", "1": "1", "2": "2", "3": "3", "4": "4",
    "5": "5", "6": "6", "7": "7", "8": "8", "9": "9",
    "a": "𝘢", "b": "𝘣", "c": "𝘤", "d": "𝘥", "e": "𝘦",
    "f": "𝘧", "g": "𝘨", "h": "𝘩", "i": "𝘪", "j": "𝘫",
    "k": "𝘬", "l": "𝘭", "m": "𝘮", "n": "𝘯", "o": "𝘰",
    "p": "𝘱", "q": "𝘲", "r": "𝘳", "s": "𝘴", "t": "𝘵",
    "u": "𝘶", "v": "𝘷", "w": "𝘸", "x": "𝘹", "y": "𝘺",
    "z": "𝘻", "A": "𝘈", "B": "𝘉", "C": "𝘊", "D": "𝘋",
    "E": "𝘌", "F": "𝘍", "G": "𝘎", "H": "𝘏", "I": "𝘐",
    "J": "𝘑", "K": "𝘒", "L": "𝘓", "M": "𝘔", "N": "𝘕",
    "O": "𝘖", "P": "𝘗", "Q": "𝘘", "R": "𝘙", "S": "𝘚",
    "T": "𝘛", "U": "𝘜", "V": "𝘝", "W": "𝘞", "X": "𝘟",
    "Y": "𝘠", "Z": "𝘡"
};

const serif_map = {
    "0": "𝟎", "1": "𝟏", "2": "𝟐", "3": "𝟑", "4": "𝟒",
    "5": "𝟓", "6": "𝟔", "7": "𝟕", "8": "𝟖", "9": "𝟗", 
    "A": "𝐀", "B": "𝐁", "C": "𝐂", "D": "𝐃", "E": "𝐄",
    "F": "𝐅", "G": "𝐆", "H": "𝐇", "I": "𝐈", "J": "𝐉",
    "K": "𝐊", "L": "𝐋", "M": "𝐌", "N": "𝐍", "O": "𝐎",
    "P": "𝐏", "Q": "𝐐", "R": "𝐑", "S": "𝐒", "T": "𝐓",
    "U": "𝐔", "V": "𝐕", "W": "𝐖", "X": "𝐗", "Y": "𝐘",
    "Z": "𝐙", "a": "𝐚", "b": "𝐛", "c": "𝐜", "d": "𝐝",
    "e": "𝐞", "f": "𝐟", "g": "𝐠", "h": "𝐡", "i": "𝐢",
    "j": "𝐣", "k": "𝐤", "l": "𝐥", "m": "𝐦", "n": "𝐧",
    "o": "𝐨", "p": "𝐩", "q": "𝐪", "r": "𝐫", "s": "𝐬",
    "t": "𝐭", "u": "𝐮", "v": "𝐯", "w": "𝐰", "x": "𝐱",
    "y": "𝐲", "z": "𝐳"
};

const serif_italic_map = {
    "0": "𝟎", "1": "𝟏", "2": "𝟐", "3": "𝟑", "4": "𝟒",
    "5": "𝟓", "6": "𝟔", "7": "𝟕", "8": "𝟖", "9": "𝟗", 
    "A": "𝑨", "B": "𝑩", "C": "𝑪", "D": "𝑫", "E": "𝑬",
    "F": "𝑭", "G": "𝑮", "H": "𝑯", "I": "𝑰", "J": "𝑱",
    "K": "𝑲", "M": "𝑴", "N": "𝑵", "L": "𝑳", "O": "𝑶",
    "P": "𝑷", "Q": "𝑸", "R": "𝑹", "S": "𝑺", "T": "𝑻",
    "U": "𝑼", "V": "𝑽", "W": "𝑾", "X": "𝑿", "Y": "𝒀",
    "Z": "𝒁", "a": "𝒂", "b": "𝒃", "c": "𝒄", "d": "𝒅",
    "e": "𝒆", "f": "𝒇", "g": "𝒈", "h": "𝒉", "i": "𝒊",
    "j": "𝒋", "k": "𝒌", "m": "𝒎", "n": "𝒏", "l": "𝒍",
    "o": "𝒐", "p": "𝒑", "q": "𝒒", "r": "𝒓", "s": "𝒔",
    "t": "𝒕", "u": "𝒖", "v": "𝒗", "q": "𝒒", "x": "𝒙",
    "y": "𝒚", "z": "𝒛"
};

const sans_map = {
    "0": "𝟢", "1": "𝟣", "2": "𝟤", "3": "𝟥", "4": "𝟦", 
    "5": "𝟧", "6": "𝟨", "7": "𝟩", "8": "𝟪", "9": "𝟫", 
    "A": "𝖠", "B": "𝖡", "C": "𝖢", "D": "𝖣", "E": "𝖤", 
    "F": "𝖥", "G": "𝖦", "H": "𝖧", "I": "𝖨", "J": "𝖩", 
    "K": "𝖪", "L": "𝖫", "M": "𝖬", "N": "𝖭", "O": "𝖮", 
    "P": "𝖯", "Q": "𝖰", "R": "𝖱", "S": "𝖲", "T": "𝖳",
    "U": "𝖴", "V": "𝖵", "W": "𝖶", "X": "𝖷", "Y": "𝖸", 
    "Z": "𝖹", "a": "𝖺", "b": "𝖻", "c": "𝖼", "d": "𝖽", 
    "e": "𝖾", "f": "𝖿", "g": "𝗀", "h": "𝗁", "i": "𝗂", 
    "j": "𝗃", "k": "𝗄", "l": "𝗅", "m": "𝗆", "n": "𝗇",
    "o": "𝗈", "p": "𝗉", "q": "𝗊", "r": "𝗋", "s": "𝗌", 
    "t": "𝗍", "u": "𝗎", "v": "𝗏", "w": "𝗐", "x": "𝗑", 
    "y": "𝗒", "z": "𝗓",
};

const bold_sans_map = {
    "0": "𝟬", "1": "𝟭", "2": "𝟮", "3": "𝟯", "4": "𝟰",
    "5": "𝟱", "6": "𝟲", "7": "𝟳", "8": "𝟴", "9": "𝟵",
    "A": "𝗔", "B": "𝗕", "C": "𝗖", "D": "𝗗", "E": "𝗘", 
    "F": "𝗙", "G": "𝗚", "H": "𝗛", "I": "𝗜", "J": "𝗝",
    "K": "𝗞", "L": "𝗟", "M": "𝗠", "N": "𝗡", "O": "𝗢",
    "P": "𝗣", "Q": "𝗤", "R": "𝗥", "S": "𝗦", "T": "𝗧",
    "U": "𝗨", "V": "𝗩", "W": "𝗪", "X": "𝗫", "Y": "𝗬", 
    "Z": "𝗭", "a": "𝗮", "b": "𝗯", "c": "𝗰", "d": "𝗱", 
    "e": "𝗲", "f": "𝗳", "g": "𝗴", "h": "𝗵", "i": "𝗶", 
    "j": "𝗷", "k": "𝗸", "l": "𝗹", "m": "𝗺", "n": "𝗻", 
    "o": "𝗼", "p": "𝗽", "q": "𝗾", "r": "𝗿", "s": "𝘀", 
    "t": "𝘁", "u": "𝘂", "v": "𝘃", "w": "𝘄", "x": "𝘅", 
    "y": "𝘆", "z": "𝘇",
};

const monospace_map = {
    "0": "𝟶", "1": "𝟷", "2": "𝟸", "3": "𝟹", "4": "𝟺",
    "5": "𝟻", "6": "𝟼", "7": "𝟽", "8": "𝟾", "9": "𝟿",
    "A": "𝙰", "B": "𝙱", "C": "𝙲", "D": "𝙳", "E": "𝙴",
    "F": "𝙵", "G": "𝙶", "H": "𝙷", "I": "𝙸", "J": "𝙹",
    "K": "𝙺", "L": "𝙻", "M": "𝙼", "N": "𝙽", "O": "𝙾",
    "P": "𝙿", "Q": "𝚀", "R": "𝚁", "S": "𝚂", "T": "𝚃",
    "U": "𝚄", "V": "𝚅", "W": "𝚆", "X": "𝚇", "Y": "𝚈",
    "Z": "𝚉", "a": "𝚊", "b": "𝚋", "c": "𝚌", "d": "𝚍", 
    "e": "𝚎", "f": "𝚏", "g": "𝚐", "h": "𝚑", "i": "𝚒", 
    "j": "𝚓", "k": "𝚔", "l": "𝚕", "m": "𝚖", "n": "𝚗", 
    "o": "𝚘", "p": "𝚙", "q": "𝚚", "r": "𝚛", "s": "𝚜", 
    "t": "𝚝", "u": "𝚞", "v": "𝚟", "w": "𝚠", "x": "𝚡", 
    "y": "𝚢", "z": "𝚣"
};

const double_struck_map = {
    "0": "𝟘", "1": "𝟙", "2": "𝟚", "3": "𝟛", "4": "𝟜",
    "5": "𝟝", "6": "𝟞", "7": "𝟟", "8": "𝟠", "9": "𝟡",
    "A": "𝔸", "B": "𝔹", "C": "ℂ", "D": "𝔻", "E": "𝔼", 
    "F": "𝔽", "G": "𝔾", "H": "ℍ", "I": "𝕀", "J": "𝕁", 
    "K": "𝕂", "L": "𝕃", "M": "𝕄", "N": "ℕ", "O": "𝕆", 
    "P": "ℙ", "Q": "ℚ", "R": "ℝ", "S": "𝕊", "T": "𝕋",
    "U": "𝕌", "V": "𝕍", "W": "𝕎", "X": "𝕏", "Y": "𝕐", 
    "Z": "ℤ", "a": "𝕒", "b": "𝕓", "c": "𝕔", "d": "𝕕", 
    "e": "𝕖", "f": "𝕗", "g": "𝕘", "h": "𝕙", "i": "𝕚", 
    "j": "𝕛", "k": "𝕜", "l": "𝕝", "m": "𝕞", "n": "𝕟", 
    "o": "𝕠", "p": "𝕡", "q": "𝕢", "r": "𝕣", "s": "𝕤",
    "t": "𝕥", "u": "𝕦", "v": "𝕧", "w": "𝕨", "x": "𝕩",
    "y": "𝕪", "z": "𝕫" 
};

const small_caps_map = {
    "0": "0", "1": "1", "2": "2", "3": "3", "4": "4",
    "5": "5", "6": "6", "7": "7", "8": "8", "9": "9",
    "A": "ᴀ", "B": "ʙ", "C": "ᴄ", "D": "ᴅ", "E": "ᴇ", 
    "F": "ꜰ", "G": "ɢ", "H": "ʜ", "I": "ɪ", "J": "ᴊ", 
    "K": "ᴋ", "L": "ʟ", "M": "ᴍ", "N": "ɴ", "O": "ᴏ", 
    "P": "ᴩ", "Q": "q", "R": "ʀ", "S": "ꜱ", "T": "ᴛ",
    "U": "ᴜ", "V": "ᴠ", "W": "ᴡ", "X": "x", "Y": "y",
    "Z": "ᴢ", "a": "ᴀ", "b": "ʙ", "c": "ᴄ", "d": "ᴅ", 
    "e": "ᴇ", "f": "ꜰ", "g": "ɢ", "h": "ʜ", "i": "ɪ", 
    "j": "ᴊ", "k": "ᴋ", "l": "ʟ", "m": "ᴍ", "n": "ɴ",
    "o": "ᴏ", "p": "ᴩ", "q": "q", "r": "ʀ", "s": "ꜱ", 
    "t": "ᴛ", "u": "ᴜ", "v": "ᴠ", "w": "ᴡ", "x": "x", 
    "y": "y", "z": "ᴢ"
};

const cursive_map = {
    "0": "0", "1": "1", "2": "2", "3": "3", "4": "4",
    "5": "5", "6": "6", "7": "7", "8": "8", "9": "9",
    "A": "𝓐", "B": "𝓑", "C": "𝓒", "D": "𝓓", "E": "𝓔",
    "F": "𝓕", "G": "𝓖", "H": "𝓗", "I": "𝓘", "J": "𝓙",
    "K": "𝓚", "L": "𝓛", "M": "𝓜", "N": "𝓝", "O": "𝓞",
    "P": "𝓟", "Q": "𝓠", "R": "𝓡", "S": "𝓢", "T": "𝓣", 
    "U": "𝓤", "V": "𝓥", "W": "𝓦", "X": "𝓧", "Y": "𝓨", 
    "Z": "𝓩", "a": "𝓪", "b": "𝓫", "c": "𝓬", "d": "𝓭", 
    "e": "𝓮", "f": "𝓯", "g": "𝓰", "h": "𝓱", "i": "𝓲", 
    "j": "𝓳", "k": "𝓴", "l": "𝓵", "m": "𝓶", "n": "𝓷", 
    "o": "𝓸", "p": "𝓹", "q": "𝓺", "r": "𝓻", "s": "𝓼", 
    "t": "𝓽", "u": "𝓾", "v": "𝓿", "w": "𝔀", "x": "𝔁", 
    "y": "𝔂", "z": "𝔃", 
};

const cursive_bold_map = {
    "0": "0", "1": "𝟏", "2": "𝟐", "3": "𝟑", "4": "𝟒",
    "5": "𝟓", "6": "𝟔", "7": "𝟕", "8": "𝟖", "9": "𝟗",
    "A": "𝓐", "B": "𝓑", "C": "𝓒", "D": "𝓓", "E": "𝓔",
    "F": "𝓕", "G": "𝓖", "H": "𝓗", "I": "𝓘", "J": "𝓙",
    "K": "𝓚", "L": "𝓛", "M": "𝓜", "N": "𝓝", "O": "𝓞",
    "P": "𝓟", "Q": "𝓠", "R": "𝓡", "S": "𝓢", "T": "𝓣",
    "U": "𝓤", "V": "𝓥", "W": "𝓦", "X": "𝓧", "Y": "𝓨",
    "Z": "𝓩", "a": "𝓪", "b": "𝓫", "c": "𝓬", "d": "𝓭",
    "e": "𝓮", "f": "𝓯", "g": "𝓰", "h": "𝓱", "i": "𝓲",
    "j": "𝓳", "k": "𝓴", "l": "𝓵", "m": "𝓶", "n": "𝓷",
    "o": "𝓸", "p": "𝓹", "q": "𝓺", "r": "𝓻", "s": "𝓼",
    "t": "𝓽", "u": "𝓾", "v": "𝓿", "w": "𝔀", "x": "𝔁",
    "y": "𝔂", "z": "𝔃"
};

const fraktur_map = {
    "0": "0", "1": "1", "2": "2", "3": "3", "4": "4",
    "5": "5", "6": "6", "7": "7", "8": "8", "9": "9",
    "A": "𝔄", "B": "𝔅", "C": "ℭ", "D": "𝔇", "E": "𝔈",
    "F": "𝔉", "G": "𝔊", "H": "ℌ", "I": "ℑ", "J": "𝔍",
    "K": "𝔎", "L": "𝔏", "M": "𝔐", "N": "𝔑", "O": "𝔒",
    "P": "𝔓", "Q": "𝔔", "R": "ℜ", "S": "𝔖", "T": "𝔗",
    "U": "𝔘", "V": "𝔙", "W": "𝔚", "X": "𝔛", "Y": "𝔜",
    "Z": "ℨ", "a": "𝔞", "b": "𝔟", "c": "𝔠", "d": "𝔡",
    "e": "𝔢", "f": "𝔣", "g": "𝔤", "h": "𝔥", "i": "𝔦",
    "j": "𝔧", "k": "𝔨", "l": "𝔩", "m": "𝔪", "n": "𝔫",
    "o": "𝔬", "p": "𝔭", "q": "𝔮", "r": "𝔯", "s": "𝔰",
    "t": "𝔱", "u": "𝔲", "v": "𝔳", "w": "𝔴", "x": "𝔵",
    "y": "𝔶", "z": "𝔷"
};

const fraktur_bold_map = {
    "0": "0", "1": "1", "2": "2", "3": "3", "4": "4",
    "5": "5", "6": "6", "7": "7", "8": "8", "9": "9",
    "A": "𝕬", "B": "𝕭", "C": "𝕮", "D": "𝕯", "E": "𝕰",
    "F": "𝕱", "G": "𝕲", "H": "𝕳", "I": "𝕴", "J": "𝕵",
    "K": "𝕶", "L": "𝕷", "M": "𝕸", "N": "𝕹", "O": "𝕺",
    "P": "𝕻", "Q": "𝕼", "R": "𝕽", "S": "𝕾", "T": "𝕿",
    "U": "𝖀", "V": "𝖁", "W": "𝖂", "X": "𝖃", "Y": "𝖄",
    "Z": "𝖅", "a": "𝖆", "b": "𝖇", "c": "𝖈", "d": "𝖉",
    "e": "𝖊", "f": "𝖋", "g": "𝖌", "h": "𝖍", "i": "𝖎",
    "j": "𝖏", "k": "𝖐", "l": "𝖑", "m": "𝖒", "n": "𝖓",
    "o": "𝖔", "p": "𝖕", "q": "𝖖", "r": "𝖗", "s": "𝖘",
    "t": "𝖙", "u": "𝖚", "v": "𝖛", "w": "𝖜", "x": "𝖝",
    "y": "𝖞", "z": "𝖟"
};

const squares_map = {
    "0": "0", "1": "1", "2": "2", "3": "3", "4": "4",
    "5": "5", "6": "6", "7": "7", "8": "8", "9": "9",
    "A": "🄰", "B": "🄱", "C": "🄲", "D": "🄳", "E": "🄴",
    "F": "🄵", "G": "🄶", "H": "🄷", "I": "🄸", "J": "🄹",
    "K": "🄺", "L": "🄻", "M": "🄼", "N": "🄽", "O": "🄾",
    "P": "🄿", "Q": "🅀", "R": "🅁", "S": "🅂", "T": "🅃",
    "U": "🅄", "V": "🅅", "W": "🅆", "X": "🅇", "Y": "🅈",
    "Z": "🅉", "a": "🄰", "b": "🄱", "c": "🄲", "d": "🄳", 
    "e": "🄴", "f": "🄵", "g": "🄶", "h": "🄷", "i": "🄸", 
    "j": "🄹", "k": "🄺", "l": "🄻", "m": "🄼", "n": "🄽", 
    "o": "🄾", "p": "🄿", "q": "🅀", "r": "🅁", "s": "🅂", 
    "t": "🅃", "u": "🅄", "v": "🅅", "w": "🅆", "x": "🅇", 
    "y": "🅈", "z": "🅉"
};

const circle_map = {
    "0": "⓪", "1": "①", "2": "②", "3": "③", "4": "④",
    "5": "⑤", "6": "⑥", "7": "⑦", "8": "⑧", "9": "⑨",
    "A": "Ⓐ", "B": "Ⓑ", "C": "Ⓒ", "D": "Ⓓ", "E": "Ⓔ", 
    "F": "Ⓕ", "G": "Ⓖ", "H": "Ⓗ", "I": "Ⓘ", "J": "Ⓙ", 
    "K": "Ⓚ", "L": "Ⓛ", "M": "Ⓜ", "N": "Ⓝ", "O": "Ⓞ", 
    "P": "Ⓟ", "Q": "Ⓠ", "R": "Ⓡ", "S": "Ⓢ", "T": "Ⓣ",
    "U": "Ⓤ", "V": "Ⓥ", "W": "Ⓦ", "X": "Ⓧ", "Y": "Ⓨ", 
    "Z": "Ⓩ", "a": "ⓐ", "b": "ⓑ", "c": "ⓒ", "d": "ⓓ", 
    "e": "ⓔ", "f": "ⓕ", "g": "ⓖ", "h": "ⓗ", "i": "ⓘ", 
    "j": "ⓙ", "k": "ⓚ", "l": "ⓛ", "m": "ⓜ", "n": "ⓝ",
    "o": "ⓞ", "p": "ⓟ", "q": "ⓠ", "r": "ⓡ", "s": "ⓢ", 
    "t": "ⓣ", "u": "ⓤ", "v": "ⓥ", "w": "ⓦ", "x": "ⓧ", 
    "y": "Ⓨ", "z": "ⓩ",
};

const filled_circle_map = {
    "0": "⓿", "1": "➊", "2": "➋", "3": "➌", "4": "➍",
    "5": "➎", "6": "➏", "7": "➐", "8": "➑", "9": "➒",
    "A": "🅐", "B": "🅑", "C": "🅒", "D": "🅓", "E": "🅔",
    "F": "🅕", "G": "🅖", "H": "🅗", "I": "🅘", "J": "🅙",
    "K": "🅚", "L": "🅛", "M": "🅜", "N": "🅝", "O": "🅞",
    "P": "🅟", "Q": "🅠", "R": "🅡", "S": "🅢", "T": "🅣",
    "U": "🅤", "V": "🅥", "W": "🅦", "X": "🅧", "Y": "🅨",
    "Z": "🅩", "a": "🅐", "b": "🅑", "c": "🅒", "d": "🅓",
    "e": "🅔", "f": "🅕", "g": "🅖", "h": "🅗", "i": "🅘",
    "j": "🅙", "k": "🅚", "l": "🅛", "m": "🅜", "n": "🅝",
    "o": "🅞", "p": "🅟", "q": "🅠", "r": "🅡", "s": "🅢",
    "t": "🅣", "u": "🅤", "v": "🅥", "w": "🅦", "x": "🅧",
    "y": "🅨", "z": "🅩"
};

const wide_map = {
    "0": "０", "1": "１", "2": "２", "3": "３", "4": "４",
    "5": "５", "6": "６", "7": "７", "8": "８", "9": "９",
    "A": "Ａ", "B": "Ｂ", "C": "Ｃ", "D": "Ｄ", "E": "Ｅ",
    "F": "Ｆ", "G": "Ｇ", "H": "Ｈ", "I": "Ｉ", "J": "Ｊ",
    "K": "Ｋ", "M": "Ｍ", "N": "Ｎ", "L": "Ｌ", "O": "Ｏ",
    "P": "Ｐ", "Q": "Ｑ", "R": "Ｒ", "S": "Ｓ", "T": "Ｔ",
    "U": "Ｕ", "V": "Ｖ", "W": "Ｗ", "X": "Ｘ", "Y": "Ｙ",
    "Z": "Ｚ", "a": "ａ", "b": "ｂ", "c": "ｃ", "d": "ｄ",
    "e": "ｅ", "f": "ｆ", "g": "ｇ", "h": "ｈ", "i": "ｉ",
    "j": "ｊ", "k": "ｋ", "m": "ｍ", "n": "ｎ", "l": "ｌ",
    "o": "ｏ", "p": "ｐ", "q": "ｑ", "r": "ｒ", "s": "ｓ",
    "t": "ｔ", "u": "ｕ", "v": "ｖ", "q": "ｑ", "x": "ｘ",
    "y": "ｙ", "z": "ｚ", "<": "<", ">": ">", "?": "？", 
    "`": "`", "-": "－", "=": "＝", "~": "~", "!": "！", 
    "@": "＠", "#": "＃", "$": "＄", "%": "％", "^": "^", 
    "&": "＆", "*": "＊", "(": "（", ")": "）", "_": "_",
    "+": "＋", "[": "[", "]": "]", "\\": "\\", "{": "{",
    "}": "}", "|": "|", ";": "；", "'": "＇", ":": "：", 
    "\"": "\"", ",": "，", ".": "．", "/": "／",
};

const superscript_map = {
    "0": "⁰", "1": "¹", "2": "²", "3": "³", "4": "⁴",
    "5": "⁵", "6": "⁶", "7": "⁷", "8": "⁸", "9": "⁹",
    "A": "ᴬ", "B": "ᴮ", "C": "ᶜ", "D": "ᴰ", "E": "ᴱ", 
    "F": "ᶠ", "G": "ᴳ", "H": "ᴴ", "I": "ᴵ", "J": "ᴶ",
    "K": "ᴷ", "L": "ᴸ", "M": "ᴹ", "N": "ᴺ", "O": "ᴼ",
    "P": "ᴾ", "Q": "Q", "R": "ᴿ", "S": "ˢ", "T": "ᵀ",
    "U": "ᵁ", "V": "ⱽ", "W": "ᵂ", "X": "ˣ", "Y": "ʸ",
    "Z": "ᶻ", "a": "ᵃ", "b": "ᵇ", "c": "ᶜ", "d": "ᵈ", 
    "e": "ᵉ", "f": "ᶠ", "g": "ᵍ", "h": "ʰ", "i": "ⁱ", 
    "j": "ʲ", "k": "ᵏ", "l": "ˡ", "m": "ᵐ", "n": "ⁿ",
    "o": "ᵒ", "p": "ᵖ", "q": "q", "r": "ʳ", "s": "ˢ",
    "t": "ᵗ", "u": "ᵘ", "v": "ᵛ", "w": "ʷ", "x": "ˣ", 
    "y": "ʸ", "z": "ᶻ", "+": "⁺", "-": "⁻", "=": "⁼",
    "(": "⁽", ")": "⁾"
};

const strikethrough_map = {
    "0": "0̵", "1": "1̵", "2": "2̵", "3": "3̵", "4": "4̵",
    "5": "5̵", "6": "6̵", "7": "7̵", "8": "8̵", "9": "9̵",
    "A": "A̵", "B": "B̵", "C": "C̵", "D": "D̵", "E": "E̵",
    "F": "F̵", "G": "G̵", "H": "H̵", "I": "I̵", "J": "J̵",
    "K": "K̵", "L": "L̵", "M": "M̵", "N": "N̵", "O": "O̵",
    "P": "P̵", "Q": "Q̵", "R": "R̵", "S": "S̵", "T": "T̵",
    "U": "U̵", "V": "V̵", "W": "W̵", "X": "X̵", "Y": "Y̵",
    "Z": "Z̵", "a": "a̵", "b": "b̵", "c": "c̵", "d": "d̵",
    "e": "e̵", "f": "f̵", "g": "g̵", "h": "h̵", "i": "i̵",
    "j": "j̵", "k": "k̵", "l": "l̵", "m": "m̵", "n": "n̵",
    "o": "o̵", "p": "p̵", "q": "q̵", "r": "r̵", "s": "s̵",
    "t": "t̵", "u": "u̵", "v": "v̵", "w": "w̵", "x": "x̵",
    "y": "y̵", "z": "z̵"
};

const underlined_map = {
    "0": "0͟", "1": "1͟", "2": "2͟", "3": "3͟", "4": "4͟",
    "5": "5͟", "6": "6͟", "7": "7͟", "8": "8͟", "9": "9͟",
    "A": "A͟", "B": "B͟", "C": "C͟", "D": "D͟", "E": "E͟",
    "F": "F͟", "G": "G͟", "H": "H͟", "I": "I͟", "J": "J͟",
    "K": "K͟", "M": "M͟", "N": "N͟", "L": "L͟", "O": "O͟",
    "P": "P͟", "Q": "Q͟", "R": "R͟", "S": "S͟", "T": "T͟",
    "U": "U͟", "V": "V͟", "W": "W͟", "X": "X͟", "Y": "Y͟",
    "Z": "Z͟", "a": "a͟", "b": "b͟", "c": "c͟", "d": "d͟",
    "e": "e͟", "f": "f͟", "g": "g͟", "h": "h͟", "i": "i͟",
    "j": "j͟", "k": "k͟", "m": "m͟", "n": "n͟", "l": "l͟",
    "o": "o͟", "p": "p͟", "q": "q͟", "r": "r͟", "s": "s͟",
    "t": "t͟", "u": "u͟", "v": "v͟", "q": "q͟", "x": "x͟",
    "y": "y͟", "z": "z͟"
};

// 0123456789ABCDEFGHIJKMNLOPQRSTUVWXYZabcdefghijkmnlopqrstuvqxyz
// https://lingojam.com/CircledTextGenerator

const header = $("header");
const textbox = $("#textbox");
const left_arrow = $("#arrow-buttons button").eq(0);
const right_arrow = $("#arrow-buttons button").eq(1);
const clear_button = $("#clear-button");
const copy_button = $("#copy-button");

var fonts_array = [bold_map, italic_map, bold_italic_map, serif_map, serif_italic_map, sans_map, bold_sans_map, monospace_map, double_struck_map, small_caps_map, cursive_map, fraktur_map, fraktur_bold_map, squares_map, circle_map, filled_circle_map, wide_map, superscript_map, strikethrough_map, underlined_map];
var fonts_name_array = ["Bold", "Italic", "Bold Italic", "Serif", "Serif Italic", "Sans", "Bold Sans", "MonoSpace", "Double Struck", "Small Caps", "Cursive", "Fraktur", "Fraktur Bold", "Squares", "Circles", "Filled Circles", "Wide", "Subscript", "Superscript", "StrikeThrough", "Underlined"];
var current_font = 0;

var textbox_blured = false;


function changeHeader() {
    header.text("Font: " + fonts_name_array[current_font]);
}


function applyFont(letter_map, text) {
    if (!text) {
        return false;
    }

    let font_string = "";
    for (let letter of text) {
        if (letter_map[letter]) {
            font_string += letter_map[letter];
        } else font_string += letter
    }

    return font_string;
}


// Makes it where you can start typing on the textbox as soon as the extension is opened
textbox.focus();


// Font converter
textbox.on('input', function() {
    let current_text = textbox.val();
    console.log(current_text);
    let font = fonts_array[current_font]
    let font_text = applyFont(font, current_text);

    if (font_text == false) {
        return;
    } 

    let cursor_positon = textbox[0].selectionStart;

    textbox.val(font_text);
    localStorage.setItem("savedText", current_text);

    // Prevents cursor from jumping to the end everytime
    // so you can type in the middle of the text
    textbox[0].selectionStart = cursor_positon;
    textbox[0].selectionEnd = cursor_positon;
});


clear_button.click(function() {
    localStorage.setItem("savedText", "");
    textbox.val("");
    textbox.focus();
});


copy_button.click(function() {
    textbox.select();
    try {
        document.execCommand("copy");
    } catch (err) {
        alert(err)
    }
    textbox.blur();
});


// Arrow buttons, changes the current font

function leftArrowAction() {
    if (current_font == 0) {
        current_font = fonts_array.length - 1;
        changeHeader();
        //textbox.focus();
        return;
    }

    current_font--;
    changeHeader();
    //textbox.focus();
}

function rightArrowAction() {
    if (current_font + 1 == fonts_array.length) {
        current_font = 0;
        changeHeader();
        //textbox.focus();
        return;
    }

    current_font++;
    changeHeader();
    //textbox.focus();
}


left_arrow.click(function() {
    leftArrowAction();
});


right_arrow.click(function() {
    rightArrowAction();
});


// The blured part checks if the user is currently in the text box or not
// so you are able to use the arrow keys in the text box
$(document).keydown(function(key) {    
    if (key.code == "ArrowLeft" && textbox_blured) {
        leftArrowAction();
    } else if (key.code == "ArrowRight" && textbox_blured) {
        rightArrowAction();
    }
});


$(document).ready(function() {

    // Saves progress
    const savedText = localStorage.getItem("savedText");
    if (savedText) {
        textbox.val(savedText);
    }


    // For hotkeys
    textbox.blur(function() {
        textbox_blured = true;
    })
    
    textbox.focus(function() {
        textbox_blured = false;
    })
});
